ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                          if (received_action.payloadPedalAction_st.systemAction_u8==(uint8_t)PedalSystemAction::ESP_BOOT_INTO_DOWNLOAD_MODE)
                          {
                            #ifdef ESPNow_S3
                              ActiveSerial->println("Restart into Download mode");
                              delay(1000);
                              REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                              ESP.restart();
                            #else
                              ActiveSerial->println("Command not supported");
                              delay(1000);
                            #endif
                            //ESPNOW_BootIntoDownloadMode = false;
                          }
                          if (received_action.payloadPedalAction_st.systemAction_u8 == (uint8_t)PedalSystemAction::PRINT_PEDAL_INFO)
                          {
                            char logString[200];
                            snprintf(logString, sizeof(logString),
                                    "Pedal ID: %d\nBoard: %s\nLoadcell shift= %.3f kg\nLoadcell variance= %.3f kg\nPSU voltage:%.1f V\nMax endstop:%lu\nCurrentPos:%lu\n\0",
                                     sct_dap_config_st.payloadPedalConfig_st.pedalType_u8, CONTROL_BOARD, loadcell->getBiasEstimate(), loadcell->getStandardDeviationEstimate(), ((float)stepper->getServosVoltage() / 10.0f), dap_calculationVariables_st.stepperPosMaxEndstop_i32, dap_calculationVariables_st.currentPedalPosition_u32);
                            ActiveSerial->println(logString);
                          }

                          // Send action to pedalUpdateTask via Queue
                          xQueueSend(s_actionCommandQueue, &received_action, (TickType_t)0);
                          // trigger return pedal position
                          if (received_action.payloadPedalAction_st.returnPedalConfig_u8)
                          {
                          
                            DapConfig_t * dap_config_st_local_ptr;
                            dap_config_st_local_ptr = &sct_dap_config_st;
                            dap_config_st_local_ptr->payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
                            dap_config_st_local_ptr->payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
                            dap_config_st_local_ptr->payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
                            dap_config_st_local_ptr->payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
                            uint16_t crc = checksumCalculator_u16((uint8_t*)(&(sct_dap_config_st.payloadHeader_st)), sizeof(sct_dap_config_st.payloadHeader_st) + sizeof(sct_dap_config_st.payloadPedalConfig_st));
                            dap_config_st_local_ptr->payloadFooter_st.checkSum_u16 = crc;

                            // suspend the serial Tx task so that data can properly be send
                            vTaskSuspend(handle_serialCommunicationTx);
                            delay(50);
                            ActiveSerial->write((char*)dap_config_st_local_ptr, sizeof(DapConfig_t));
                            ActiveSerial->print("Return pedal config");
                            delay(50);
                            vTaskResume(handle_serialCommunicationTx);

                          }
                          #ifdef ESPNOW_Enable
                            if(received_action.payloadPedalAction_st.rudderAction_u8==1)//Enable Rudder
                            {
                              if(dap_calculationVariables_st.rudderStatus_b==false)
                              {
                                dap_calculationVariables_st.rudderStatus_b=true;
                                ActiveSerial->println("Rudder on");
                                Rudder_initializing=true;
                                moveSlowlyToPosition_b=true;
                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                              else
                              {
                                dap_calculationVariables_st.rudderStatus_b=false;
                                ActiveSerial->println("Rudder off");
                                Rudder_deinitializing=true;
                                moveSlowlyToPosition_b=true; 

                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                            }
                            if(received_action.payloadPedalAction_st.rudderBrakeAction_u8==1)
                            {
                              if(dap_calculationVariables_st.rudderBrakeStatus_b==false&&dap_calculationVariables_st.rudderStatus_b==true)
                              {
                                dap_calculationVariables_st.rudderBrakeStatus_b=true;
                                ActiveSerial->println("Rudder brake on");
                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                              else
                              {
                                dap_calculationVariables_st.rudderBrakeStatus_b=false;
                                ActiveSerial->println("Rudder brake off");
                                //ActiveSerial->print("status:");
                                //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                              }
                            }
                            //clear rudder status
                            if(received_action.payloadPedalAction_st.rudderAction_u8==2)
                            {
                              dap_calculationVariables_st.rudderStatus_b=false;
                              dap_calculationVariables_st.rudderBrakeStatus_b=false;
                              ActiveSerial->println("Rudder Status Clear");
                              Rudder_deinitializing=true;
                              moveSlowlyToPosition_b=true;

