ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                            }
                          #endif
                          
                          

                          
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:{
                    memcpy(&dap_action_ota_st, packet_start, sizeof(DapActionOta_t));
                    ActiveSerial->println("Get OTA command");
                    buzzerBeepAction_b=true;

                    //ActiveSerial->readBytes((char*)&dap_action_ota_st, sizeof(DapActionOta_t));
                    #ifdef OTA_update
                      if(dap_action_ota_st.payloadHeader_st.payloadType_u8==DAP_PAYLOAD_TYPE_ACTION_OTA_U8)
                      {
                        if(dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 == sct_dap_config_st.payloadPedalConfig_st.pedalType_u8)
                        {
                          g_SSID=new char[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8+1];
                          g_PASS=new char[dap_action_ota_st.payloadOtaInfo_st.passLength_u8+1];
                          memcpy(g_SSID,dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8,dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8);
                          memcpy(g_PASS,dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8,dap_action_ota_st.payloadOtaInfo_st.passLength_u8);
                          g_SSID[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8]=0;
                          g_PASS[dap_action_ota_st.payloadOtaInfo_st.passLength_u8]=0;
                          g_OTA_enable_b=true;
                          g_OTA_enable_start=true;
                          #ifdef ESPNOW_Enable
                            g_ESPNow_OTA_enable=false;
                          #endif
                        }
                      }
                    #else
                      ActiveSerial->println("The command is not supported");
                    #endif    
                    break;
                }
case DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8: {
                      DAP_servo_config_st received_servo_config;
                      memcpy(&received_servo_config, packet_start, sizeof(DAP_servo_config_st));

                      calculated_crc = checksumCalculator_u16((uint8_t*)(&(received_servo_config.payloadHeader_st)), sizeof(received_servo_config.payloadHeader_st) + sizeof(received_servo_config.payloadServoConfig_st));
                      received_crc = received_servo_config.payloadFooter_st.checkSum_u16;

                      if (calculated_crc != received_crc || received_servo_config.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
                      {
                          structIsValid = false;
                      }
                      else
                      {
                          ActiveSerial->println("Valid servo config packet received");
                          uint8_t validFields = received_servo_config.payloadServoConfig_st.numValidFields;
                          if (validFields > 10) validFields = 10;

                          if (received_servo_config.payloadServoConfig_st.readWriteFlag == 1) {
                              // Write
                              for (uint8_t i = 0; i < validFields; i++) {
                                  uint16_t addr = received_servo_config.payloadServoConfig_st.registerAddresses[i];
                                  uint16_t val = received_servo_config.payloadServoConfig_st.registerValues[i];
                                  if (stepper != nullptr) {
                                      ServoModbusCmd_t cmd = {};
                                      cmd.startAddr_u16 = addr;
                                      cmd.count_u8      = 1;   // single register per packet
                                      cmd.isWrite_b     = true;
                                      cmd.values[0] = (int16_t)(val & 0xFFFF);
                                      stepper->scheduleServoModbusCmd(cmd);
                                  }
                                  ActiveSerial->printf("Servo config write: addr=0x%X, val=%u\n", addr, val);
                                  // Add small delay to avoid overwriting pending command too quickly
                                  vTaskDelay(pdMS_TO_TICKS(10));
                              }
                          } else {
                              // Read
                              // Assuming validFields > 0, we schedule the first requested register.
                              // If multiple sequential registers are requested, we could optimize,
                              // but here we simply read from the first address for 'validFields' count.
                              if (validFields > 0 && stepper != nullptr) {
                                  uint16_t addr = received_servo_config.payloadServoConfig_st.registerAddresses[0];
                                  ServoModbusCmd_t cmd = {};
                                  cmd.startAddr_u16 = addr;
                                  cmd.count_u8      = validFields;
                                  if (cmd.count_u8 > 8) cmd.count_u8 = 8; // Modbus limit
                                  cmd.isWrite_b     = false;
                                  stepper->scheduleServoModbusCmd(cmd);
                                  ActiveSerial->printf("Servo config read scheduled: addr=0x%X, count=%u\n", addr, cmd.count_u8);
                              }
                          }
                      }
                      break;
                  }

                  
              } // end switch

                if (!structIsValid)
                {
                  ActiveSerial->printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
                  buffer_idx++; // Skip the failed SOF and continue scanning
                }
                else
                {
                  // Packet was valid and processed, advance index past this packet
                  buffer_idx += expectedSize;
              }
          } // end while

          // --- 3. Clean up the buffer ---
              if (buffer_idx > 0)
              {
              size_t remaining_len = buffer_len - buffer_idx;
                if (remaining_len > 0)
                {
                  memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
              }
              buffer_len = remaining_len;
          }

          profiler_serialCommunicationTask.end(0);
          profiler_serialCommunicationTask.report();
        } // end if TaskNotifyTake
    } // end for(;;)
}



uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR_FLAG serialCommunicationTaskTx( void * pvParameters )
{ 
  // FunctionProfiler profiler_serialCommunicationTask;
  // profiler_serialCommunicationTask.setName("SerialCommunicationTx");
  // profiler_serialCommunicationTask.setNumberOfCalls(500);

  // static DapConfig_t sct_dap_config_st;

