ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  // This task now waits for a complete package of data from the queue.
  PedalStatePackage_t receivedState;

  for (;;)
  {

    // global_dap_config_class.getConfig(&sct_dap_config_st, 0);

    // Block indefinitely until a new state package arrives from pedalUpdateTask.
    // This is now the ONLY trigger for this task.
    if (xQueueReceive(s_pedalStateQueue, &receivedState, portMAX_DELAY) == pdPASS)
    {
      
      // Now, process the first item, and then enter a loop to
      // empty the rest of the queue.
      do {
                
        // Copy to a local variable to calculate CRC
        DapStateBasic_t basic_to_send = receivedState.basic_st;
        DapStateExtended_t extended_to_send = receivedState.extended_st;



  // Provide pedal states to ESPnow task
  #ifdef ESPNOW_Enable
        // update pedal states
        if (s_semaphore_updatePedalStates != NULL)
        {
          if (xSemaphoreTake(s_semaphore_updatePedalStates, (TickType_t)0) == pdTRUE)
          {
            // move local structure values to global structures
            dap_state_basic_st = basic_to_send;
            dap_state_extended_st = extended_to_send;

            // release semaphore
            xSemaphoreGive(s_semaphore_updatePedalStates);
          }
        }
        else
        {
          s_semaphore_updatePedalStates = xSemaphoreCreateMutex();
        }
  #endif



        // activate profiler depending on pedal config
        // if (sct_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER) 
        // {
        //   profiler_serialCommunicationTask.activate( true );
        // }
        // else
        // {
        //   profiler_serialCommunicationTask.activate( false );
        // }
        // // start profiler 0, overall function
        // profiler_serialCommunicationTask.start(0);

        // send basic pedal state struct
        if (receivedState.sendBasicFlag_b)
        {
          // update CRC before transmission
          basic_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(basic_to_send.payloadHeader_st)), sizeof(basic_to_send.payloadHeader_st) + sizeof(basic_to_send.payloadPedalStateBasic_st));
          ActiveSerial->write((char*)&basic_to_send, sizeof(DapStateBasic_t));
        }

        // send extended pedal state struct
        if (receivedState.sendExtendedFlag_b)
        {
          // update CRC before transmission
          extended_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(extended_to_send.payloadHeader_st)), sizeof(extended_to_send.payloadHeader_st) + sizeof(extended_to_send.payloadPedalStateExtended_st));
          ActiveSerial->write((char*)&extended_to_send, sizeof(DapStateExtended_t));
        }

        // --- Send servo Modbus read result back to SimHub plugin ---
        if (stepper != nullptr) {
          uint16_t addr_u16 = 0;
          int16_t  vals[8]  = {};
          uint8_t  cnt_u8   = 0;
          if (stepper->tryGetServoModbusReadResult(addr_u16, vals, cnt_u8) && cnt_u8 > 0) {
            DAP_servo_config_st_t resp = {};
            resp.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
            resp.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
            resp.payloadHeader_st.payloadType_u8   = DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8;
            resp.payloadHeader_st.version_u8       = DAP_VERSION_CONFIG_U8;
            resp.payloadHeader_st.storeToEeprom_u8 = 0;
            resp.payloadHeader_st.pedalTag_u8      = 0;
            resp.payloadServoConfig_st.readWriteFlag  = 0; // read response
            resp.payloadServoConfig_st.numValidFields = cnt_u8;
            for (uint8_t i = 0; i < cnt_u8; i++) {
              resp.payloadServoConfig_st.registerAddresses[i] = addr_u16 + i;
              resp.payloadServoConfig_st.registerValues[i]    = (uint16_t)vals[i];
            }
            resp.payloadFooter_st.checkSum_u16 = checksumCalculator_u16(
              (uint8_t*)(&resp.payloadHeader_st),
              sizeof(resp.payloadHeader_st) + sizeof(resp.payloadServoConfig_st));
            resp.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
            resp.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
            ActiveSerial->write((char*)&resp, sizeof(DAP_servo_config_st_t));
          }
        }

        // profiler_serialCommunicationTask.end(0);

        // // print profiler results
        // profiler_serialCommunicationTask.report();
      // Continue looping with a zero timeout to process any other items that are
      // already in the queue. The loop will exit when the queue is empty.
      } while (xQueueReceive(s_pedalStateQueue, &receivedState, (TickType_t)0) == pdPASS);


      // force a context switch
      // taskYIELD();
    }
  }
}


//OTA multitask
void otaUpdateTask( void * pvParameters )
{
  uint16_t OTA_count = 0;
  unsigned long ota_debug_messaage_last = 0;
  bool message_out_b = false;
  int OTA_update_status = 99;

  for (;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {

      if (OTA_count > 200)
      {
        message_out_b = true;
        OTA_count = 0;
      }
      else
      {
        OTA_count++;
      }

      #if defined(OTA_update)  || defined(OTA_update_ESP32)
      if(g_OTA_enable_b)
      {
        if(message_out_b)
        {
          message_out_b=false;
          Serial1.println("OTA enable flag on");
        }
        if(g_OTA_status)
        {
          #ifdef OTA_update_ESP32
            server.handleClient();
          #endif
          #ifdef OTA_update
            if(OTA_update_status==0)
            {
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
              ESP.restart();
            }
            else
            {
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
              {
                //updload ota from platformio
                //sendESPNOWLog("Upload from platformIO");
                ArduinoOTA.handle(); 
                if(millis()-ota_debug_messaage_last>1000)
                {
                  ActiveSerial->println("Wait for ota update...");
                }
                
