ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
          profiler_espNow.start(1);

          //joystick value broadcast
          /*
          if((joystickPacketsUpdateLast-millis())>joystickPacketInterval) 
          {
            ESPNow_Joystick_Broadcast(joystickNormalizedToInt32);
            joystickPacketsUpdateLast=millis();
          }
          */
          
          profiler_espNow.end(1);

          profiler_espNow.start(2);
          // assignment request packet send out
          if(assignmentUpdatePacketSend_b && noAssignmentStatus)
          {
            //ActiveSerial->println("Send out assignment request");
            assignmentUpdatePacketSend_b=false;
            DapAssignmentBroadcast_t dap_assignmentBoardcast_st;
            dap_assignmentBoardcast_st.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
            dap_assignmentBoardcast_st.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
            dap_assignmentBoardcast_st.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
            dap_assignmentBoardcast_st.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_ASSIGNMENT_U8;
            dap_assignmentBoardcast_st.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
            dap_assignmentBoardcast_st.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
            dap_assignmentBoardcast_st.payloadAssignmentRequest_st.assignmentAction_u8=1;
            memcpy(dap_assignmentBoardcast_st.payloadAssignmentRequest_st.macAddress_au8,g_esp_Mac,6);
            uint16_t crc = 0;
            crc = checksumCalculator_u16((uint8_t *)(&(dap_assignmentBoardcast_st.payloadHeader_st)), sizeof(dap_assignmentBoardcast_st.payloadHeader_st) + sizeof(dap_assignmentBoardcast_st.payloadAssignmentRequest_st));
            dap_assignmentBoardcast_st.payloadFooter_st.checkSum_u16=crc;
            ESPNow.send_message(g_broadcast_mac, (uint8_t *)&dap_assignmentBoardcast_st, sizeof(DapAssignmentBroadcast_t));
          }
          // basic state packet send out  
          if(basic_state_send_b && !noAssignmentStatus)
          {
            // update pedal states
            DapStateBasic_t dap_state_basic_st_lcl;       
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
            if(s_semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(s_semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE basic pedal state struct
                dap_state_basic_st_lcl = dap_state_basic_st;

                // release semaphore
                xSemaphoreGive(s_semaphore_updatePedalStates);
                dap_state_basic_st_lcl.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(dap_state_basic_st_lcl.payloadHeader_st)), sizeof(dap_state_basic_st_lcl.payloadHeader_st) + sizeof(dap_state_basic_st_lcl.payloadPedalStateBasic_st));
              }
            }
            else
            {
              s_semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }
            ESPNow.send_message(g_broadcast_mac,(uint8_t *) & dap_state_basic_st_lcl,sizeof(dap_state_basic_st_lcl));
            basic_state_send_b=false;
          }

          profiler_espNow.end(2);

          profiler_espNow.start(3);

          if (extend_state_send_b && !noAssignmentStatus)
          {
            // update pedal states
            DapStateExtended_t dap_state_extended_st_espNow; 
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_extended_st_espNow, 0, sizeof(dap_state_extended_st_espNow));
            if(s_semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(s_semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE extended pedal state struct
                dap_state_extended_st_espNow = dap_state_extended_st; 
                // release semaphore
                xSemaphoreGive(s_semaphore_updatePedalStates);
                dap_state_extended_st_espNow.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(dap_state_extended_st_espNow.payloadHeader_st)), sizeof(dap_state_extended_st_espNow.payloadHeader_st) + sizeof(dap_state_extended_st_espNow.payloadPedalStateExtended_st));
              }
            }
            else
            {
              s_semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }

            ESPNow.send_message(g_broadcast_mac,(uint8_t *)&dap_state_extended_st_espNow, sizeof(dap_state_extended_st_espNow));
            extend_state_send_b=false;
          }

          profiler_espNow.end(3);

          if (g_ESPNow_config_request && !noAssignmentStatus)
          {
            DapConfig_t * dap_config_st_local_ptr;
            dap_config_st_local_ptr = &espnow_dap_config_st;
            dap_config_st_local_ptr->payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
            dap_config_st_local_ptr->payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
            dap_config_st_local_ptr->payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
            dap_config_st_local_ptr->payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
            dap_config_st_local_ptr->payloadHeader_st.pedalTag_u8 = dap_config_st_local_ptr->payloadPedalConfig_st.pedalType_u8;
            uint16_t crc=0;
            crc = checksumCalculator_u16((uint8_t*)(&(espnow_dap_config_st.payloadHeader_st)), sizeof(espnow_dap_config_st.payloadHeader_st) + sizeof(espnow_dap_config_st.payloadPedalConfig_st));
            dap_config_st_local_ptr->payloadFooter_st.checkSum_u16 = crc;
            ESPNow.send_message(g_broadcast_mac,(uint8_t *) & espnow_dap_config_st, sizeof(espnow_dap_config_st));
            g_ESPNow_config_request=false;
            sendESPNOWLog("Pedal:%d Config returned by user request, CRC:%d", espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8, crc);
            delay(2);
          }

          if (g_ESPNow_OTA_enable && !noAssignmentStatus)
          {
            ActiveSerial->println("Get OTA command");
            
